lkolbly/cmsis-svd/data/TexasInstruments/LM3S1538.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART1</name>
      <prependToName>UART1</prependToName>
      <baseAddress>0x4000D000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART2</name>
      <prependToName>UART2</prependToName>
      <baseAddress>0x4000E000</baseAddress>
    </peripheral>
    <peripheral>
      <name>I2C0</name>
      <description>Register map for I2C0 peripheral</description>
      <groupName>I2C</groupName>
      <prependToName>I2C0</prependToName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MSA</name>
          <description>I2C Master Slave Address</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>I2C_MSA_RS</name>
              <description>Receive not send</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MSA_SA</name>
              <description>I2C Slave Address</description>
              <bitRange>[7:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SOAR</name>
          <description>I2C Slave Own Address</description>
          <addressOffset>0x00000800</addressOffset>
          <fields>
            <field>
              <name>I2C_SOAR_OAR</name>
              <description>I2C Slave Own Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCSR</name>
          <description>I2C Slave Control/Status</description>
          <addressOffset>0x00000804</addressOffset>
          <fields>
            <field>
              <name>I2C_SCSR_RREQ</name>
              <description>Receive Request</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_SCSR_TREQ</name>
              <description>Transmit Request</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_SCSR_FBR</name>
              <description>First Byte Received</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCSR</name>
          <description>I2C Slave Control/Status</description>
          <alternateGroup>I2C0_ALT</alternateGroup>
          <addressOffset>0x00000804</addressOffset>
          <fields>
            <field>
              <name>I2C_SCSR_DA</name>
              <description>Device Active</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCS</name>
          <description>I2C Master Control/Status</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>I2C_MCS_RUN</name>
              <description>I2C Master Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_START</name>
              <description>Generate START</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_ADRACK</name>
              <description>Acknowledge Address</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_ACK</name>
              <description>Data Acknowledge Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_ARBLST</name>
              <description>Arbitration Lost</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_IDLE</name>
              <description>I2C Idle</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_BUSBSY</name>
              <description>Bus Busy</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCS</name>
          <description>I2C Master Control/Status</description>
          <alternateGroup>I2C0_ALT</alternateGroup>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>I2C_MCS_BUSY</name>
              <description>I2C Busy</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_ERROR</name>
              <description>Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_STOP</name>
              <description>Generate STOP</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_DATACK</name>
              <description>Acknowledge Data</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SDR</name>
          <description>I2C Slave Data</description>
          <addressOffset>0x00000808</addressOffset>
          <fields>
            <field>
              <name>I2C_SDR_DATA</name>
              <description>Data for Transfer</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MDR</name>
          <description>I2C Master Data</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>I2C_MDR_DATA</name>
              <description>Data Transferred</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MTPR</name>
          <description>I2C Master Timer Period</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>I2C_MTPR_TPR</name>
              <description>SCL Clock Period</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SIMR</name>
          <description>I2C Slave Interrupt Mask</description>
          <addressOffset>0x0000080C</addressOffset>
          <fields>
            <field>
              <name>I2C_SIMR_DATAIM</name>
              <description>Data Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRIS</name>
          <description>I2C Slave Raw Interrupt Status</description>
          <addressOffset>0x00000810</addressOffset>
          <fields>
            <field>
              <name>I2C_SRIS_DATARIS</name>
              <description>Data Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIMR</name>
          <description>I2C Master Interrupt Mask</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>I2C_MIMR_IM</name>
              <description>Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MRIS</name>
          <description>I2C Master Raw Interrupt Status</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>I2C_MRIS_RIS</name>
              <description>Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMIS</name>
          <description>I2C Slave Masked Interrupt Status</description>
          <addressOffset>0x00000814</addressOffset>
          <fields>
            <field>
              <name>I2C_SMIS_DATAMIS</name>
              <description>Data Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SICR</name>
          <description>I2C Slave Interrupt Clear</description>
          <addressOffset>0x00000818</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>I2C_SICR_DATAIC</name>
              <description>Data Interrupt Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MMIS</name>
          <description>I2C Master Masked Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>I2C_MMIS_MIS</name>
              <description>Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MICR</name>
          <description>I2C Master Interrupt Clear</description>
          <addressOffset>0x0000001C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>I2C_MICR_IC</name>
              <description>Interrupt Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR</name>
          <description>I2C Master Configuration</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>I2C_MCR_LPBK</name>
              <description>I2C Loopback</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MCR_MFE</name>
              <description>I2C Master Function Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2C_MCR_SFE</name>
              <description>I2C Slave Function Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
